# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11-seg instance segmentation model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 4 # number of classes
ch: 9
scale: m


scales: # model compound scaling constants, i.e. 'model=yolo11n-segALI.yaml' will call yolo11n-segALI.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 203 layers, 2876848 parameters, 2876832 gradients, 10.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 203 layers, 10113248 parameters, 10113232 gradients, 35.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 253 layers, 22420896 parameters, 22420880 gradients, 123.9 GFLOPs
  l: [1.00, 1.00, 512] # summary: 379 layers, 27678368 parameters, 27678352 gradients, 143.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: 379 layers, 62142656 parameters, 62142640 gradients, 320.2 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [ -1, 1, Silence, [ ] ]  # 0-P1/2
  #memory 1
  - [ 0, 1, SilenceChannel, [ 6,9 ] ]  # 1-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] #4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]#6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] #8
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]#10
  - [-1, 1, SPPF, [1024, 5]] # 11
  - [-1, 2, C2PSA, [1024]] # 12
  #memory2
  - [ 0, 1, SilenceChannel, [ 3,6 ] ]  # 13-P1/2
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 14-P1/2
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 15-P2/4
  - [ -1, 2, C3k2, [ 256, False, 0.25 ] ]#16
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 17-P3/8
  - [ -1, 2, C3k2, [ 512, False, 0.25 ] ] #18
  - [ -1, 1, Conv, [ 512, 3, 2 ] ] # 19-P4/16
  - [ -1, 2, C3k2, [ 512, True ] ] # 20
  - [ -1, 1, Conv, [ 1024, 3, 2 ] ] # 21-P5/32
  - [ -1, 2, C3k2, [ 1024, True ] ] #22
  - [ -1, 1, SPPF, [ 1024, 5 ] ] # 23
  - [ -1, 2, C2PSA, [ 1024 ] ] # 24
    #detected image
  - [ 0, 1, SilenceChannel, [ 0,3 ] ]  # 25-P1/2
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 26-P1/2
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 27-P2/4
  - [ -1, 2, C3k2, [ 256, False, 0.25 ] ] #28
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 29-P3/8
  - [ -1, 2, C3k2, [ 512, False, 0.25 ] ] #30
  - [ -1, 1, Conv, [ 512, 3, 2 ] ] # 31-P4/16
  - [ -1, 2, C3k2, [ 512, True ] ] #32
  - [ -1, 1, Conv, [ 1024, 3, 2 ] ] # 33-P5/32
  - [ -1, 2, C3k2, [ 1024, True ] ] #34
  - [ -1, 1, SPPF, [ 1024, 5 ] ] # 35
  - [ -1, 2, C2PSA, [ 1024 ] ] # 36
  #Temporal aspect
  - [ [ 6, 18 ], 1, ConcatSpe, [ 0 ] ] #37 cat backbone P3
  - [ [-1, 30],1, SDM, [256] ] #feature 1 38
  - [ [ 8, 20 ], 1, ConcatSpe, [ 0 ] ] # cat backbone P4 39
  - [ [-1, 32],1, SDM, [ 512 ] ] #feature 2 40
  - [ [ 10, 22 ], 1, ConcatSpe, [ 0 ] ] # cat backbone P4 #41
  - [ [-1, 34],1, SDM, [1024] ] #feature 3 # 42


# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #43
  - [[-1, 40], 1, Concat, [1]] # cat backbone P4 44
  - [-1, 2, C3k2, [512, False]] # 45

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #46
  - [[-1, 38], 1, Concat, [1]] # cat backbone P3 #47
  - [-1, 2, C3k2, [256, False]] # (P3/8-small) #48

  - [-1, 1, Conv, [256, 3, 2]] #49
  - [[-1, 45], 1, Concat, [1]] # cat head P4 #50
  - [-1, 2, C3k2, [512, False]] # 51 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] #52
  - [[-1, 42], 1, Concat, [1]] # cat head P5 #53
  - [-1, 2, C3k2, [1024, True]] # 54 (P5/32-large)

  - [[48, 51, 54], 1, Segment, [nc, 32, 256]] # Detect(P3, P4, P5)